Repository: VaheAvetikyan/cattlea
Catalog: cattlea/apps/orders/locale/*/LC_MESSAGES/django.po
Languages: hy

source: Order History
hy: Գնումների պատմություն

source: Order Number
hy: Պատվերի համարը

source: Size
hy: Չափսը

source: Color
hy: Գույնը

source: Sex
hy: Սեռը

source: Qty
hy: Քանակը

source: Total
hy: Ընդհ

source: Shipping Address
hy: Առաքման հասցե

source: Ordered on
hy: Գնման օրը

source: Delivered
hy: Առաքված է

source: Out for delivery
hy: Ճանապարհին է

source: Ordered
hy: Պատվիրված է

source: Mark as Received
hy: Նշել որպես ստացած
